#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S #журавликов. Сколько журавликов сделал каждый ребенок, если известно, что Петя и #Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза #больше журавликов, чем Петя и Сережа вместе?
print(“Введите число: “)
Summa = int(input())
Petya = int(0)
Sergei = int(0)
Katya = int(0)
Petya = Summa / 6
Sergei = Petya
Katya = (2/3) * Summa
print(“Petya {}” .format(Petya))
print(“Katya {}” .format(Katya))
print(“Sergei {}” .format(Sergei))
